Catalogs/КлассификаторЕдиницИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторЕдиницИзмерения</Name>
			<Comment>Единицы хранения складских остатков. Обычно заполняется по классификатору ОКЕИ</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование единицы измерения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МераКоличества</Name>
					<Comment>ФФД 1.2. Тег 2108</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.МераКоличестваПредметаРасчетаККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторЕдиницИзмерения/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "Код")
	Тогда
		Код = ДанныеЗаполнения.Код;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый()
		И ПустаяСтрока(Код)
	Тогда
		ОписаниеОКЕИ = Справочники.КлассификаторЕдиницИзмерения.ОписаниеЕдиницыОКЕИ(, Наименование, НаименованиеПолное);
		Если ОписаниеОКЕИ.Код <> Неопределено Тогда
			Код = ОписаниеОКЕИ.Код;
			
			Если ДополнительныеСвойства.Свойство("НормализоватьНаименованияПоОКЕИ") Тогда
				
				Наименование = ОписаниеОКЕИ.Наименование;
				НаименованиеПолное = ОписаниеОКЕИ.НаименованиеПолное;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоНовый()
		И Не ЗначениеЗаполнено(МераКоличества)
		И ЗначениеЗаполнено(Код)
	Тогда
		МераКоличества = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(Код);
		Если Не ЗначениеЗаполнено(МераКоличества) Тогда
			МераКоличества = РаботаСТорговымОборудованием.МераКоличестваПоНаименованиюЕдиницы(НаименованиеПолное, Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
